valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Motix/TLE5502/tle5502_tle987x_integrationexample/RTE/Device/TLE9872QXA40/uart.h
/*
 ***********************************************************************************************************************
 *
 * Copyright (c) Infineon Technologies AG
 * All rights reserved.
 *
 * The applicable license agreement can be found at this pack's installation directory in the file
 * license/IFX_SW_Licence_MOTIX_LITIX.txt
 *
 **********************************************************************************************************************/
/**
 * \file     uart.h
 *
 * \brief    UART low level access library
 *
 * \version  V0.2.5
 * \date     02. Jan 2025
 */

/*******************************************************************************
**                             Author(s) Identity                             **
********************************************************************************
** Initials     Name                                                          **
** ---------------------------------------------------------------------------**
** DM           Daniel Mysliwitz                                              **
** BG           Blandine Guillot                                              **
** JO           Julia Ott                                                     **
** VO           Vanessa Ongaro                                                **
*******************************************************************************/

/*******************************************************************************
**                          Revision Control History                          **
********************************************************************************
** V0.1.0: 2014-05-11, DM:   Initial version                                  **
** V0.1.1: 2014-07-22, DM:   BGL baudrate calculation fixed                   **
** V0.1.2: 2015-02-10, DM:   Individual header file added                     **
** V0.1.3: 2015-07-15, DM:   STDIN/STDOUT function added                      **
** V0.1.4: 2017-02-15, DM:   GetByte, isByteReceived and isByteTransmitted    **
**                           inline functions added                           **
**                           Baudrate_Set function added                      **
** V0.1.5: 2017-10-20, DM:   MISRA 2012 compliance, the following PC-Lint     **
**                           rules are globally deactivated:                  **
**                           - Info 793: ANSI/ISO limit of 6 'significant     **
**                             characters in an external identifier           **
**                           - Info 835: A zero has been given as right       **
**                             argument to operator                           **
**                           - Info 845: The left argument to operator '&'    **
**                             is certain to be 0                             **
** V0.1.6: 2018-02-02, DM:   BaudRate_Set function corrected                  **
** V0.1.7: 2018-03-20, DM:   Preprocessor checks modified to allow only one   **
**                           UART to be STDIN/STDOUT at a time                **
** V0.1.8: 2018-11-27, JO:   Doxygen update                                   **
**                           Moved revision history from uart.c to uart.h     **
**                           Added ranges for UART1_BaudRate_Set and          **
**                           UART2_BaudRate_Set                               **
**                           Adapted the implementation of stdout_putchar     **
**                           and stdin_getchar for UART1 and UART2 so that    **
**                           they follow the same procedure                   **
**                           UART1_BaudRate_Value_Set(),                      **
**                           UART2_BaudRate_Value_Set() functions added       **
** V0.1.9: 2019-09-11, JO:   Corrected ranges for UART1_BaudRate_Set and      **
**                           UART2_BaudRate_Set                               **
** V0.2.0: 2020-04-15, BG:   Updated revision history format                  **
** V0.2.1: 2020-07-13, JO:   EP-431: remove ARMCC v6 Compiler warnings        **
**                           - added static to definition of uart1 and uart2  **
** V0.2.2: 2020-07-21, BG:   EP-439: Formatted .h/.c files                    **
** V0.2.3: 2022-02-28, JO:   EP-936: Updated copyright and branding           **
** V0.2.4: 2022-10-18, VO:   EP-1252: Updated sruct definition                **
** V0.2.5: 2025-01-02, JO:   EP-1493: Updated license                         **
*******************************************************************************/

#ifndef UART_H
#define UART_H

/*******************************************************************************
**                                  Includes                                  **
*******************************************************************************/
#include "tle987x.h"
#include "types.h"
#include "uart_defines.h"
#include "sfr_access.h"

/*******************************************************************************
**                           Global Type Definitions                          **
*******************************************************************************/
/** \struct TUart
 *  \brief This struct lists parameter (clock) of UART1/UART2.
 */
typedef struct Uart
{
  uint32 clock;
} TUart;

/*******************************************************************************
**                     Global Inline Function Definitions                     **
*******************************************************************************/
/** \brief Writes the baudrate timer register (UART1).
 * \note Setting new Baud-rate value must be when BaudRateGen is disabled.
 *
 * \brief <b>Example</b><br>
 * \brief This example receives a Byte via UART1 (baud-rate is equal to 19200 when frequency is equal to 40MHz).
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 ch;
 *
 *     UART1_Receiver_En();
 *     UART1_BaudRateGen_Dis();
 *     UART1_BaudRate_Value_Set(0x1046);
 *     UART1_BaudRateGen_En();
 *     if (UART1_isByteReceived() == TRUE)
 *     {
 *       ch = UART1_Get_Byte();
 *     }
 *     UART1_Receiver_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART1_BaudRate_Value_Set(uint16 br_val)
{
  Field_Wrt8all(&SCU->BGH1.reg, (uint8)(br_val >> 8u));
  Field_Wrt8all(&SCU->BGL1.reg, (uint8)(br_val & (uint16)0x00FF));
}

