valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Motix/TLE5502/tle5502_tle987x_integrationexample/RTE/Device/TLE9872QXA40/uart.h
/** \brief disables Baud-rate generator (UART1).
 * \note Setting new Baud-rate value must be when BaudRateGen is disabled.
 *
 * \brief <b>Example</b><br>
 * \brief This example receives a Byte via UART1 (baud-rate is equal to 19200 when frequency is equal to 40MHz).
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 ch;
 *
 *     UART1_Receiver_En();
 *     UART1_BaudRateGen_Dis();
 *     UART1_BaudRate_Value_Set(0x1046);
 *     UART1_BaudRateGen_En();
 *     if (UART1_isByteReceived() == TRUE)
 *     {
 *       ch = UART1_Get_Byte();
 *     }
 *     UART1_Receiver_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART1_BaudRateGen_Dis(void)
{
  Field_Mod8(&SCU->BCON1.reg, (uint8)SCU_BCON1_R_Pos, (uint8)SCU_BCON1_R_Msk, 0u);
}


/** \brief enables Baud-rate generator (UART1).
 * \note Setting new Baud-rate value must be when BaudRateGen is disabled.
 *
 * \brief <b>Example</b><br>
 * \brief This example receives a Byte via UART1 (baud-rate is equal to 19200 when frequency is equal to 40MHz).
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 ch;
 *
 *     UART1_Receiver_En();
 *     UART1_BaudRateGen_Dis();
 *     UART1_BaudRate_Value_Set(0x1046);
 *     UART1_BaudRateGen_En();
 *     if (UART1_isByteReceived() == TRUE)
 *     {
 *       ch = UART1_Get_Byte();
 *     }
 *     UART1_Receiver_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART1_BaudRateGen_En(void)
{
  Field_Mod8(&SCU->BCON1.reg, (uint8)SCU_BCON1_R_Pos, (uint8)SCU_BCON1_R_Msk, 1u);
}


/** \brief Writes the baudrate timer register (UART2).
 * \note Setting new Baud-rate value must be when BaudRateGen is disabled.
 *
 * \brief <b>Example</b><br>
 * \brief This example receives a Byte via UART1 (baud-rate is equal to 19200 when frequency is equal to 40MHz).
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 ch;
 *
 *     UART2_Receiver_En();
 *     UART2_BaudRateGen_Dis();
 *     UART2_BaudRate_Value_Set(0x1046);
 *     UART2_BaudRateGen_En();
 *     if (UART2_isByteReceived() == TRUE)
 *     {
 *       ch = UART2_Get_Byte();
 *     }
 *     UART2_Receiver_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART2_BaudRate_Value_Set(uint16 br_val)
{
  Field_Wrt8all(&SCU->BGH2.reg, (uint8)(br_val >> 8u));
  Field_Wrt8all(&SCU->BGL2.reg, (uint8)(br_val & (uint16)0x00FF));
}

/** \brief disables Baud-rate generator (UART2).
 * \note Setting new Baud-rate value must be when BaudRateGen is disabled.
 *
 * \brief <b>Example</b><br>
 * \brief This example receives a Byte via UART2 (baud-rate is equal to 19200 when frequency is equal to 40MHz).
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 ch;
 *
 *     UART2_Receiver_En();
 *     UART2_BaudRateGen_Dis();
 *     UART2_BaudRate_Value_Set(0x1046);
 *     UART2_BaudRateGen_En();
 *     if (UART2_isByteReceived() == TRUE)
 *     {
 *       ch = UART2_Get_Byte();
 *     }
 *     UART2_Receiver_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART2_BaudRateGen_Dis(void)
{
  Field_Mod8(&SCU->BCON2.reg, (uint8)SCU_BCON2_R_Pos, (uint8)SCU_BCON2_R_Msk, 0u);
}

/** \brief enables Baud-rate generator (UART2).
 * \note Setting new Baud-rate value must be when BaudRateGen is disabled.
 *
 * \brief <b>Example</b><br>
 * \brief This example receives a Byte via UART2 (baud-rate is equal to 19200 when frequency is equal to 40MHz).
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 ch;
 *
 *     UART2_Receiver_En();
 *     UART2_BaudRateGen_Dis();
 *     UART2_BaudRate_Value_Set(0x1046);
 *     UART2_BaudRateGen_En();
 *     if (UART2_isByteReceived() == TRUE)
 *     {
 *       ch = UART2_Get_Byte();
 *     }
 *     UART2_Receiver_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART2_BaudRateGen_En(void)
{
  Field_Mod8(&SCU->BCON2.reg, (uint8)SCU_BCON2_R_Pos, (uint8)SCU_BCON2_R_Msk, 1u);
}

/** \brief Sends a Byte via UART1.
 *
 * \param data Byte to send
 *
 * \brief <b>Example</b><br>
 * \brief This example sends "A" via UART1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     UART1_BaudRate_Set(19200);
 *     if (UART1_isByteTransmitted() == TRUE)
 *     {
 *       UART1_TX_Int_Clr();
 *       UART1_Buffer_Set(0x41);
 *     }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART1_Buffer_Set(uint8 data)
{
  Field_Wrt8(&UART1->SBUF.reg, (uint8)UART1_SBUF_VAL_Pos, (uint8)UART1_SBUF_VAL_Msk, data);
}

/** \brief Sends a Byte via UART2.
 *
 * \param data Byte to send
 *
 * \brief <b>Example</b><br>
 * \brief This example sends "A" via UART2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     UART2_BaudRate_Set(19200);
 *     if (UART2_isByteTransmitted() == TRUE)
 *     {
 *       UART2_TX_Int_Clr();
 *       UART2_Buffer_Set(0x41);
 *     }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART2_Buffer_Set(uint8 data)
{
  Field_Wrt8(&UART2->SBUF.reg, (uint8)UART2_SBUF_VAL_Pos, (uint8)UART2_SBUF_VAL_Msk, data);
}

/** \brief Reads UART1 Buffer.
 *
 * \return Received Byte
 *
 * \brief <b>Example</b><br>
 * \brief This example receives a Byte via UART1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 ch;
 *
 *     UART1_Receiver_En();
 *     UART1_BaudRate_Set(19200);
 *     if (UART1_isByteReceived() == TRUE)
 *     {
 *       UART1_RX_Int_Clr();
 *       ch = UART1_Buffer_Get();
 *     }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE uint8 UART1_Buffer_Get(void)
{
  return (u8_Field_Rd8(&UART1->SBUF.reg, (uint8)UART1_SBUF_VAL_Pos, (uint8)UART1_SBUF_VAL_Msk));
}

/** \brief Reads UART2 Buffer.
 *
 * \return Received Byte
 *
 * \brief <b>Example</b><br>
 * \brief This example receives a Byte via UART2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 ch;
 *
 *     UART2_Receiver_En();
 *     UART2_BaudRate_Set(19200);
 *     if (UART2_isByteReceived() == TRUE)
 *     {
 *       UART2_RX_Int_Clr();
 *       ch = UART2_Buffer_Get();
 *     }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE uint8 UART2_Buffer_Get(void)
{
  return (u8_Field_Rd8(&UART2->SBUF.reg, (uint8)UART2_SBUF_VAL_Pos, (uint8)UART2_SBUF_VAL_Msk));
}

/** \brief reads the receive interrupt flag of UART1.
 *
 * \return Receive Interrupt Flag Status
 *
 * \brief <b>Example</b><br>
 * \brief This example receives a Byte via UART1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 ch;
 *
 *     UART1_Receiver_En();
 *     UART1_BaudRate_Set(19200);
 *     if (UART1_RX_Sts() == (uint8)1u)
 *     {
 *       ch = UART1_Get_Byte();
 *     }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE uint8 UART1_RX_Sts(void)
{
  return (u1_Field_Rd8(&UART1->SCON.reg, (uint8)UART1_SCON_RI_Pos, (uint8)UART1_SCON_RI_Msk));
}

/** \brief reads the transmit interrupt flag of UART1.
 *
 * \return Receive Interrupt Flag Status
 *
 * \brief <b>Example</b><br>
 * \brief This example receives a Byte via UART1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 ch;
 *
 *     UART1_Receiver_En();
 *     UART1_BaudRate_Set(19200);
 *     if (UART1_RX_Sts() == (uint8)1u)
 *     {
 *       ch = UART1_Get_Byte();
 *     }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE uint8 UART1_TX_Sts(void)
{
  return (u1_Field_Rd8(&UART1->SCON.reg, (uint8)UART1_SCON_TI_Pos, (uint8)UART1_SCON_TI_Msk));
}

/** \brief reads the receive interrupt flag of UART2.
 *
 * \return Receive Interrupt Flag Status
 *
 * \brief <b>Example</b><br>
 * \brief This example receives a Byte via UART2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 ch;
 *
 *     UART2_Receiver_En();
 *     UART2_BaudRate_Set(19200);
 *     if (UART2_RX_Sts() == (uint8)1u)
 *     {
 *       ch = UART2_Get_Byte();
 *     }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE uint8 UART2_RX_Sts(void)
{
  return (u1_Field_Rd8(&UART2->SCON.reg, (uint8)UART2_SCON_RI_Pos, (uint8)UART2_SCON_RI_Msk));
}

