valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Motix/TLE5502/tle5502_tle987x_integrationexample/RTE/Device/TLE9872QXA40/uart.h
/** \brief reads the transmit interrupt flag of UART2.
 *
 * \return Transmit Interrupt Flag Status
 *
 * \brief <b>Example</b><br>
 * \brief This example sends "A" via UART2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     UART2_BaudRate_Set(19200);
 *     if (UART2_TX_Sts() == (uint8)1u)
 *     {
 *       UART2_Send_Byte(0x41);
 *     }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE uint8 UART2_TX_Sts(void)
{
  return (u1_Field_Rd8(&UART2->SCON.reg, (uint8)UART2_SCON_TI_Pos, (uint8)UART2_SCON_TI_Msk));
}

/** \brief enables Receiver of Serial Port (UART1).
 *
 * \brief <b>Example</b><br>
 * \brief This example receives a Byte via UART1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 ch;
 *
 *     UART1_Receiver_En();
 *     UART1_BaudRate_Set(19200);
 *     if (UART1_isByteReceived() == TRUE)
 *     {
 *       ch = UART1_Get_Byte();
 *     }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART1_Receiver_En(void)
{
  Field_Mod8(&UART1->SCON.reg, (uint8)UART1_SCON_REN_Pos, (uint8)UART1_SCON_REN_Msk, 1u);
}

/** \brief disables Receiver of Serial Port (UART1).
 *
 * \brief <b>Example</b><br>
 * \brief This example receives a Byte via UART1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 ch;
 *
 *     UART1_Receiver_En();
 *     UART1_BaudRate_Set(19200);
 *     if (UART1_isByteReceived() == TRUE)
 *     {
 *       ch = UART1_Get_Byte();
 *     }
 *     UART1_Receiver_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART1_Receiver_Dis(void)
{
  Field_Mod8(&UART1->SCON.reg, (uint8)UART1_SCON_REN_Pos, (uint8)UART1_SCON_REN_Msk, 0u);
}

/** \brief enables Receiver of Serial Port (UART2).
 *
 * \brief <b>Example</b><br>
 * \brief This example receives a Byte via UART2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 ch;
 *
 *     UART2_Receiver_En();
 *     UART2_BaudRate_Set(19200);
 *     if (UART2_isByteReceived() == TRUE)
 *     {
 *       ch = UART2_Get_Byte();
 *     }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART2_Receiver_En(void)
{
  Field_Mod8(&UART2->SCON.reg, (uint8)UART2_SCON_REN_Pos, (uint8)UART2_SCON_REN_Msk, 1u);
}

/** \brief disables Receiver of Serial Port (UART2).
 *
 * \brief <b>Example</b><br>
 * \brief This example receives a Byte via UART2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 ch;
 *
 *     UART2_Receiver_En();
 *     UART2_BaudRate_Set(19200);
 *     if (UART2_isByteReceived() == TRUE)
 *     {
 *       ch = UART2_Get_Byte();
 *     }
 *     UART2_Receiver_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART2_Receiver_Dis(void)
{
  Field_Mod8(&UART2->SCON.reg, (uint8)UART2_SCON_REN_Pos, (uint8)UART2_SCON_REN_Msk, 0u);
}

/** \brief clears receive interrupt flag for UART1.
 *
 *
 * \brief <b>Example</b><br>
 * \brief This example receives a Byte via UART1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 ch;
 *
 *     UART1_Receiver_En();
 *     UART1_BaudRate_Set(19200);
 *     if (UART1_isByteReceived() == TRUE)
 *     {
 *       ch = UART1_Buffer_Get();
 *       UART1_RX_Int_Clr();
 *     }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART1_RX_Int_Clr(void)
{
  Field_Wrt8(&UART1->SCONCLR.reg, (uint8)UART1_SCONCLR_RICLR_Pos, (uint8)UART1_SCONCLR_RICLR_Msk, 1u);
}

/** \brief clears transmit interrupt flag of UART1.
 *
 * \brief <b>Example</b><br>
 * \brief This example sends "A" via UART1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     UART1_BaudRate_Set(19200);
 *     if (UART1_isByteTransmitted() == TRUE)
 *     {
 *       UART1_Buffer_Set(0x41);
 *       UART1_TX_Int_Clr();
 *     }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART1_TX_Int_Clr(void)
{
  Field_Wrt8(&UART1->SCONCLR.reg, (uint8)UART1_SCONCLR_TICLR_Pos, (uint8)UART1_SCONCLR_TICLR_Msk, 1u);
}

/** \brief clears receive interrupt flag of UART2.
 *
 * \brief <b>Example</b><br>
 * \brief This example receives a Byte via UART2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 ch;
 *
 *     UART2_Receiver_En();
 *     UART2_BaudRate_Set(19200);
 *     if (UART2_isByteReceived() == TRUE)
 *     {
 *       ch = UART2_Buffer_Get();
 *       UART2_RX_Int_Clr();
 *     }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART2_RX_Int_Clr(void)
{
  Field_Wrt8(&UART2->SCONCLR.reg, (uint8)UART2_SCONCLR_RICLR_Pos, (uint8)UART2_SCONCLR_RICLR_Msk, 1u);
}

/** \brief clears transmit interrupt flag of UART2.
 *
 * \brief <b>Example</b><br>
 * \brief This example sends "A" via UART2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     UART2_BaudRate_Set(19200);
 *     if (UART2_isByteTransmitted() == TRUE)
 *     {
 *       UART2_Buffer_Set(0x41);
 *       UART2_TX_Int_Clr();
 *     }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART2_TX_Int_Clr(void)
{
  Field_Wrt8(&UART2->SCONCLR.reg, (uint8)UART2_SCONCLR_TICLR_Pos, (uint8)UART2_SCONCLR_TICLR_Msk, 1u);
}

/* UART Interrupt Enable/Disable */
/** \brief enables receive interrupt of UART1.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the receive interrupt for UART1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     UART1_RX_Int_En();
 *     if (UART1_RX_Sts() == (uint8)1u)
 *     {
 *       UART1_RX_CALLBACK();
 *       UART1_RX_Int_Clr();
 *     }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART1_RX_Int_En(void)
{
  Field_Mod8(&SCU->MODIEN1.reg, (uint8)SCU_MODIEN1_RIEN1_Pos, (uint8)SCU_MODIEN1_RIEN1_Msk, 1u);
}

/** \brief disables receive interrupt of UART1.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the receive interrupt for UART1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     UART1_RX_Int_En();
 *     if (UART1_RX_Sts() == (uint8)1u)
 *     {
 *       UART1_RX_CALLBACK();
 *       UART1_RX_Int_Clr();
 *     }
 *     UART1_RX_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART1_RX_Int_Dis(void)
{
  Field_Mod8(&SCU->MODIEN1.reg, (uint8)SCU_MODIEN1_RIEN1_Pos, (uint8)SCU_MODIEN1_RIEN1_Msk, 0u);
}

/** \brief enables transmit interrupt of UART1.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the transmit interrupt for UART1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     UART1_TX_Int_En();
 *     if (UART1_TX_Sts() == (uint8)1u)
 *     {
 *       UART1_TX_CALLBACK();
 *       UART1_TX_Int_Clr();
 *     }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART1_TX_Int_En(void)
{
  Field_Mod8(&SCU->MODIEN1.reg, (uint8)SCU_MODIEN1_TIEN1_Pos, (uint8)SCU_MODIEN1_TIEN1_Msk, 1u);
}

