valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Motix/TLE5502/tle5502_tle987x_integrationexample/RTE/Device/TLE9872QXA40/uart.h
/** \brief disables transmit interrupt of UART1.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the transmit interrupt for UART1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     UART1_TX_Int_En();
 *     if (UART1_TX_Sts() == (uint8)1u)
 *     {
 *       UART1_TX_CALLBACK();
 *       UART1_TX_Int_Clr();
 *     }
 *     UART1_TX_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART1_TX_Int_Dis(void)
{
  Field_Mod8(&SCU->MODIEN1.reg, (uint8)SCU_MODIEN1_TIEN1_Pos, (uint8)SCU_MODIEN1_TIEN1_Msk, 0u);
}

/** \brief enables receive interrupt of UART2.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the receive interrupt for UART2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     UART2_RX_Int_En();
 *     if (UART2_RX_Sts() == (uint8)1u)
 *     {
 *       UART2_RX_CALLBACK();
 *       UART2_RX_Int_Clr();
 *     }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART2_RX_Int_En(void)
{
  Field_Mod8(&SCU->MODIEN2.reg, (uint8)SCU_MODIEN2_RIEN2_Pos, (uint8)SCU_MODIEN2_RIEN2_Msk, 1u);
}

/** \brief disables receive interrupt of UART2.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the receive interrupt for UART2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     UART2_RX_Int_En();
 *     if (UART2_RX_Sts() == (uint8)1u)
 *     {
 *       UART2_RX_CALLBACK();
 *       UART2_RX_Int_Clr();
 *     }
 *     UART2_RX_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART2_RX_Int_Dis(void)
{
  Field_Mod8(&SCU->MODIEN2.reg, (uint8)SCU_MODIEN2_RIEN2_Pos, (uint8)SCU_MODIEN2_RIEN2_Msk, 0u);
}

/** \brief enables transmit interrupt of UART2.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the transmit interrupt for UART2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     UART2_TX_Int_En();
 *     if (UART2_TX_Sts() == (uint8)1u)
 *     {
 *       UART2_TX_CALLBACK();
 *       UART2_TX_Int_Clr();
 *     }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART2_TX_Int_En(void)
{
  Field_Mod8(&SCU->MODIEN2.reg, (uint8)SCU_MODIEN2_TIEN2_Pos, (uint8)SCU_MODIEN2_TIEN2_Msk, 1u);
}

/** \brief disables transmit interrupt of UART2.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the transmit interrupt for UART2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     UART2_TX_Int_En();
 *     if (UART2_TX_Sts() == (uint8)1u)
 *     {
 *       UART2_TX_CALLBACK();
 *       UART2_TX_Int_Clr();
 *     }
 *     UART2_TX_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART2_TX_Int_Dis(void)
{
  Field_Mod8(&SCU->MODIEN2.reg, (uint8)SCU_MODIEN2_TIEN2_Pos, (uint8)SCU_MODIEN2_TIEN2_Msk, 0u);
}

/*******************************************************************************
**                        Global Function Declarations                        **
*******************************************************************************/
/** \brief Initializes the UART1 module based on the Config Wizard for MOTIX MCU configuration
 *
 * \ingroup drv_api
 */
void UART1_Init(void);

/** \brief Initializes the UART2 module based on the Config Wizard for MOTIX MCU configuration
 *
 * \ingroup drv_api
 */
void UART2_Init(void);

/** \brief Sets the baudrate of UART1.
 *
* \param baudrate baudrate, e.g. 19200, or 115200; range: 1221 to 5000000 (a value out of this range will not be applied)
 *
 * \brief <b>Example</b><br>
 * \brief This example sets UART1 BAUDRATE to 19200.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     UART1_BaudRate_Set(19200);
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup drv_api
 */
void UART1_BaudRate_Set(uint32 baudrate);

/** \brief Sets the baudrate of UART2.
 *
 * \param baudrate baudrate, e.g. 19200, or 115200; range: 1221 to 5000000 (a value out of this range will not be applied)
 *
 * \brief <b>Example</b><br>
 * \brief This example sets UART2 BAUDRATE to 19200.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     UART2_BaudRate_Set(19200);
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup drv_api
 */
void UART2_BaudRate_Set(uint32 baudrate);

/*******************************************************************************
**                     Global Inline Function Declarations                    **
*******************************************************************************/
#if ((UART1_STD_EN == 1) || (UART2_STD_EN == 1))
  /** \brief Sends a character via UART1/2.
  *
  * \param[in] Char Character to send
  * \return Sent character
  *
  * \ingroup uart_api
  */
  sint32 stdout_putchar(sint32 Char);

  /** \brief Receives a character via UART1/2.
  *
  * \return Received character
  *
  * \ingroup uart_api
  */
  sint32 stdin_getchar(void);
  void ttywrch(int ch);
#endif /* ((UART1_STD_EN == 1) || (UART2_STD_EN == 1)) */


/*******************************************************************************
**                  Global Inline Static Function Definitions                 **
*******************************************************************************/
/** \brief clears the UART1 Transmit interrupt and sends a Byte via UART1.
 *
 * \param c Byte to send
 *
 * \brief <b>Example</b><br>
 * \brief This example sends "A" via UART1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     UART1_BaudRate_Set(19200);
 *     if (UART1_isByteTransmitted() == TRUE)
 *     {
 *       UART1_Send_Byte(0x41);
 *     }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE void UART1_Send_Byte(uint8 c)
{
  UART1_TX_Int_Clr();
  UART1_Buffer_Set(c);
}

/** \brief Clears the UART1 receive interrupt and returns the UART1 buffer.
 *
 * \return Received Byte
 *
 * \brief <b>Example</b><br>
 * \brief This example receives a Byte via UART1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 ch;
 *
 *     UART1_Receiver_En();
 *     UART1_BaudRate_Set(19200);
 *     if (UART1_isByteReceived() == TRUE)
 *     {
 *       ch = UART1_Get_Byte();
 *     }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE uint8 UART1_Get_Byte(void)
{
  UART1_RX_Int_Clr();
  return (UART1_Buffer_Get());
}

/** \brief checks if UART1 has received Byte or not.
 *
 * \retval TRUE a byte was received
 * \retval FALSE no byte was received
 *
 * \brief <b>Example</b><br>
 * \brief This example receives a Byte via UART1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 ch;
 *
 *     UART1_Receiver_En();
 *     UART1_BaudRate_Set(19200);
 *     if (UART1_isByteReceived() == TRUE)
 *     {
 *       ch = UART1_Get_Byte();
 *     }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE bool UART1_isByteReceived(void)
{
  bool bRes = false;

  if (UART1_RX_Sts() == (uint8)1)
  {
    bRes = true;
  }

  return (bRes);
}

/** \brief checks if UART1 has transmitted a Byte or not.
 *
 * \retval TRUE a byte was transmitted
 * \retval FALSE no byte was transmitted
 *
 * \brief <b>Example</b><br>
 * \brief This example sends "A" via UART1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     UART1_BaudRate_Set(19200);
 *     if (UART1_isByteTransmitted() == TRUE)
 *     {
 *       UART1_Send_Byte(0x41);
 *     }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup uart_api
 */
INLINE bool UART1_isByteTransmitted(void)
{
  bool bRes = false;

  if (UART1_TX_Sts() == (uint8)1)
  {
    bRes = true;
  }

  return (bRes);
}

